import { StaticImageData } from "next/image";
import chonBuriImg from "@/public/images/chon_buri/chon_buri.jpg"; // Placeholder
import grandCanyonKiriImg from "@/public/images/chon_buri/grand_canyon_kiri.jpg"; // Placeholder
import sanctuaryOfTruthMuseum from "@/public/images/chon_buri/sanctuary_of_truth_museum.jpg";
import saphanChonMarkWithiImg from "@/public/images/chon_buri/saphan_chon_mark_withi.jpg";
import bangSaenBeachImg from "@/public/images/chon_buri/bang_saen_beach.jpg";
import khaoSamMukShrineImg from "@/public/images/chon_buri/khao_sam_muk_shrine.jpg";
import htmsChakriNareubetImg from "@/public/images/chon_buri/htms_chakri_naruebet.jpg";
import wonnaphawongBeachImg from "@/public/images/chon_buri/wonnapha_beach.jpg";

export interface Attraction {
  id: number;
  slug: string;
  name: string;
  description: string;
  highlight: string;
  image: StaticImageData | string;
  details: string;
}

export const chonBuriAttractions: Attraction[] = [
  {
    id: 1,
    slug: "grand-canyon-kiri",
    name: "แกรนด์แคนยอนคีรี",
    description:
      "บ่อดินเก่าที่กลายเป็นจุดเช็คอินสุดฮิต น้ำสีเขียวมรกตและภูเขาหิมะ",
    highlight: "ภูเขาหิมะชลบุรี",
    image: grandCanyonKiriImg, // Placeholder
    details: `แกรนด์แคนยอนคีรี หรือ เหมืองหินคีรีนคร ชลบุรี เป็นสถานที่ท่องเที่ยวที่เป็นหลุมดินเก่าที่ถูกทิ้งร้างมานาน มีเนื้อที่กว่า 100 ไร่ ลึกกว่า 30 เมตร ภายในสระมีน้ำสีเขียวมรกต และบริเวณโดยรอบมีทิวทัศน์ของภูเขาสีขาว ที่ดูเหมือนภูเขาหิมะ แต่จริงๆ แล้วมาจากภูเขาหินฝุ่นที่ถูกน้ำฝนกัดเซาะ กลายเป็นทัศนียภาพที่สวยงาม`,
  },
  {
    id: 2,
    slug: "saphan-chon-mark-withi",
    name: "สะพานชลมารควิถี",
    description: "สะพานเลียบชายทะเล ขับรถชมวิวพระอาทิตย์คกที่สวยงาม",
    highlight: "แลนด์มาร์คชลบุรี",
    image: saphanChonMarkWithiImg, // Placeholder
    details: `สะพานชลหมากวิถี ชลบุรี เป็นสถานที่ท่องเที่ยวที่เป็นสะพานเลียบทะเล ในเขตเทศบาลเมืองชลบุรี สร้างขึ้น เพื่อบรรเทาปัญหาการจราจรต่างๆ เป็นถนนที่สวยงาม ซึ่งสามารถชมทิวทัศน์ได้อย่างสวยงามและยังเป็นช่วงส่งเสริมการท่องเที่ยวในพื้นที่ ส่งผลให้สะพานแห่งนี้กลายเป็นแลนด์มาร์คสำคัญของจังหวัดชลบุรี สะพานอยู่ไม่ไกลจากหาดบางแสนและเขาสามมุข ที่สะพานแห่งนี้สามารถขับรถไปชมพระอาทิตย์ตกยามเย็นได้อีกด้วย`,
  },
  {
    id: 3,
    slug: "bang-saen-beach",
    name: "หาดบางแสน",
    description: "ชายหาดชื่อดังใกล้กรุงเทพฯ พักผ่อนใต้ร่มเงาและเล่นน้ำทะเล",
    highlight: "ทะเลใกล้กรุง",
    image: bangSaenBeachImg, // Placeholder
    details: `ที่ เที่ยวชลบุรี หาดบางแสน ชลบุรี เป็นชายหาดใกล้กรุงเทพฯ ด้วยชายหาดยาว 2.5 กิโลเมตร ปัจจุบันหาดบางแสนได้ปรับปรุงพื้นที่ให้มีความร่มรื่นสวยงามทำให้ชายหาดสวยงามมากยิ่งขึ้น และบริเวณชายหาดมีร้านอาหาร ร้านค้า และที่พักพร้อมเก้าอี้ผ้าใบ สำหรับการพักผ่อนใต้ร่มเงาของชายหาดและที่ชายหาดมีกิจกรรมมากมาย เช่น เล่นน้ำทะเล บานาน่าโบ๊ท เจ็ทสกี บริการให้เช่าจักรยาน`,
  },
  {
    id: 4,
    slug: "khao-sam-muk-shrine",
    name: "ศาลเจ้าแม่เขาสามมุข",
    description: "ศาลเจ้าเก่าแก่คู่เมืองชลบุรี ขอพรเจ้าแม่สามมุขและชมวิวทะเล",
    highlight: "ศาลเจ้าศักดิ์สิทธิ์",
    image: khaoSamMukShrineImg, // Placeholder
    details: `ศาลเจ้าเขาสามมุข ชลบุรี ศาลเจ้าอายุ 103 ปี ตั้งอยู่บนเขาสามมุขซึ่งเป็นสัญลักษณ์ในตราประจำจังหวัดชลบุรี ระหว่างบ้านอ่างศิลากับหาดบางแสน ศาลแห่งนี้ ขึ้นชื่อเรื่องความศักดิ์สิทธิ์มาช้านาน โดยเฉพาะความเชื่อของพ่อค้า ชาวประมง ก่อนออกทะเลมักจะไปกราบไหว้ขอพรที่ศาลเจ้าสามมุข ของที่นิยมไหว้คือมะพร้าวอ่อน ขนมเปี๊ยะ ผลไม้ ผู้ที่บนบานไว้จะไหว้ด้วยการจุดประทัดและซื้อของ สร้อยมุกสำหรับถวายเจ้าแม่กวนอิม ที่ เที่ยวชลบุรี`,
  },
  {
    id: 5,
    slug: "htms-chakri-naruebet",
    name: "เรือหลวงจักรีนฤเบศร",
    description:
      "เรือบรรทุกเครื่องบินลำแรกของไทย เยี่ยมชมความยิ่งใหญ่ของกองทัพเรือ",
    highlight: "เรือรบหลวง",
    image: htmsChakriNareubetImg, // Placeholder
    details: `เรือหลวงจักรีนฤเบศร์ ชลบุรี สถานที่ท่องเที่ยว จอดเทียบท่า จุกเสม็ด ฐานทัพเรือสัตหีบ ชื่อ จักรีนฤเบศร์ ได้รับพระราชทานจากพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช ซึ่งหมายถึง ผู้ปกครองราชวงศ์จักรี เป็นเรือที่สร้างขึ้นในสเปนในปี 1994 เรือลำนี้มี 11 ชั้น ยาว 182 เมตร และกว้าง 30.5 เมตร มีระบบเรดาร์ตรวจการณ์ระยะไกล บทบาทสำคัญในยามสงครามทำหน้าที่เป็นเรือธง ควบคุมและสั่งการกองเรือทั้งหมดในทะเล นอกจากนี้ยังเป็นเรือบรรทุกเครื่องบินที่ควบคุมการปฏิบัติการป้องกันภัยทางอากาศ ที่เที่ยว 1 วันใกล้กรุงเทพ`,
  },
  {
    id: 6,
    slug: "wonnapha-beach",
    name: "หาดวอนนภา",
    description: "จุดชมวิวพระอาทิตย์ตกที่เงียบสงบ นั่งชิลล์ริมทะเล",
    highlight: "จุดชมวิวพระอาทิตย์ตก",
    image: wonnaphawongBeachImg, // Placeholder
    details: `หาดวอนนภา ชลบุรี. แหล่งท่องเที่ยว คือ ชายหาดทางตอนใต้ติดกับหาดบางแสน ด้วยบรรยากาศที่เงียบสงบ หาดวอนนภา เป็นอีกหนึ่งทางเลือกสำหรับนักท่องเที่ยวที่ต้องการหลีกหนีความวุ่นวาย จุดเด่นของที่นี่คือปลายหาดมีโขดหินเป็นแนวยาวตรงกลาง และสุดหาดวอนนภาคือสะพานหาดวอนนภาซึ่งเป็นแหล่งทำมาหากินของชาวประมง และที่ชายหาดนิยมนำเสื่อมาเอง และจะมีเก้าอี้ผ้าใบให้บริการที่ต้นหาด และคนที่มาหาดนี้ไม่ชอบเล่นน้ำเพราะมีหินค่อนข้างเยอะ นิยมมานั่งสูดอากาศบริสุทธิ์และลมเย็นๆ`,
  },
];
